#include <stdio.h>

int main()
{
    int b[] = {1, 2, 3, 5, 5, 6, 7, 8, 9, 5};  // ცარიელი მასივი b-ის მიერ ინიციალიზდება
    int v = 5;  // მოძიებული მნიშვნელობა.
    size_t i = 0;  // ინდექსი რომელიც ამოწმებს ელემენტებს.

    while (v != b[i])  //მასივში არ გავა ელემენტი რომელიც ეწინააღმდეგება v-ს
    {
        if(v == b[i+1])  // თუ მომდევნო ელემენტი არის ის რაც ვეძებთ
        {
            i++;  // გადავდივართ მომდევნო ელემენტზე
            break;  // სტოპ სისტემა
        }
        i = i + 2;  // სხვა შემთხვევაში გადავდივართ მეორე ელემენტზე
    }
        
    if(i == 9)  // თუ მოძიებული არ არის მაშინ გამოიცემა შეტყობინება
    {
         printf ( "Value not found.\n" );
         return 1;
    }
    
    printf ( "Found value in place %lu.\n" , i );  // იპოვება ადგილი i-ში
    return 0;
}
